hanserf/efm32pg22_devkit/gecko_sdk_3.2.2/platform/emlib/src/em_cmu.c
// CTUNE delta needed for some series 2 chips. This delta is added to the tuning capacitance on XO.
// The inter-chip buffered crystal sharing feature added from the EFR32xG23 creates an imbalance
// between XI and XO capacitance load internally on the chip. The delta allows to compensate for
// the difference.
#if defined(_SILICON_LABS_32B_SERIES_2)
#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_3) || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_4)
static int8_t ctuneDelta = 40; // Recommendation from analog team to counter the internal chip imbalance.
#else
static int8_t ctuneDelta = 0;
#endif
#endif

/*******************************************************************************
 **************************   LOCAL PROTOTYPES   *******************************
 ******************************************************************************/

#if (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
#if defined(PDM_PRESENT)
static void     em01GrpbClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(EUSART_PRESENT)
static void     em01GrpcClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(EUART_PRESENT)
static void     euart0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(EUSART_PRESENT)
static void     eusart0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(LCD_PRESENT)
static void     lcdClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(VDAC_PRESENT)
static void     vdac0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#if (VDAC_COUNT > 1)
static void     vdac1ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#endif
#if defined(PCNT_PRESENT)
static void     pcnt0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if defined(LESENSE_PRESENT)
static void     lesenseHFClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
#if (_SILICON_LABS_EFR32_RADIO_TYPE != _SILICON_LABS_EFR32_RADIO_NONE)
static void     rhclkPrescMax(void);
static void     rhclkPrescOptimize(void);
#endif
#endif

#if defined(HFRCOEM23_PRESENT)
static uint32_t HFRCOEM23DevinfoGet(CMU_HFRCOEM23Freq_TypeDef freq);
#endif
static void     traceClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     dpllRefClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     em01GrpaClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     em23GrpaClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     em4GrpaClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     flashWaitStateControl(uint32_t coreFreq, int vscale);
static uint32_t HFRCODPLLDevinfoGet(CMU_HFRCODPLLFreq_TypeDef freq);
static void     iadcClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
static void     pclkDivMax(void);
static void     pclkDivOptimize(void);
#if defined(RTCC_PRESENT)
static void     rtccClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#elif defined(SYSRTC_PRESENT)
static void     sysrtcClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
static void     waitStateMax(void);
static void     wdog0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#if WDOG_COUNT > 1
static void     wdog1ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
#endif
static void     sysTickClkGet(uint32_t *freq, CMU_Select_TypeDef *sel);
/** @endcond */

#if (_SILICON_LABS_32B_SERIES_2_CONFIG > 1)
/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Enable/disable a clock.
 *
 * @details
 *   Module clocks sre disabled after reset. If a module clock is disabled, the
 *   registers of that module are not accessible and accessing such registers
 *   will hardfault the Cortex core.
 *
 * @param[in] clock
 *   The clock to enable/disable.
 *
 * @param[in] enable
 *   @li true - enable specified clock.
 *   @li false - disable specified clock.
 ******************************************************************************/
void CMU_ClockEnable(CMU_Clock_TypeDef clock, bool enable)
{
  volatile uint32_t *reg = NULL;
  uint32_t          bit;

  /* Identify the enable register. */
  if (((unsigned)clock >> CMU_EN_REG_POS) == CMU_NO_EN_REG) {
    EFM_ASSERT(false);                      /* No enable for this clock. */
  } else if (((unsigned)clock >> CMU_EN_REG_POS) == CMU_CLKEN0_EN_REG) {
    reg = &CMU->CLKEN0;
  } else if (((unsigned)clock >> CMU_EN_REG_POS) == CMU_CLKEN1_EN_REG) {
    reg = &CMU->CLKEN1;
  } else {
#if defined(CRYPTOACC_PRESENT)
    reg = &CMU->CRYPTOACCCLKCTRL;
#else
    // No register to enable clock. Possible hard fault exception.
    EFM_ASSERT(false);
#endif
  }

  /* Get the bit position used to enable/disable. */
  bit = ((unsigned)clock >> CMU_EN_BIT_POS) & CMU_EN_BIT_MASK;

  /* Set/clear bit as requested. */
  BUS_RegBitWrite(reg, bit, (uint32_t)enable);
}

/***************************************************************************//**
 * @brief
 *   Get clock frequency for a clock point.
 *
 * @param[in] clock
 *   Clock point to fetch frequency for.
 *
 * @return
 *   The current frequency in Hz.
 ******************************************************************************/
uint32_t CMU_ClockFreqGet(CMU_Clock_TypeDef clock)
{
  uint32_t ret = 0U;
  uint32_t freq = 0U;

  switch (clock) {
    case cmuClock_SYSCLK:
      ret = SystemSYSCLKGet();
      break;

    case cmuClock_HCLK:
    case cmuClock_CORE:
    case cmuClock_ICACHE:
    case cmuClock_MSC:
    case cmuClock_LDMA:
    case cmuClock_SMU:
#if defined(CRYPTOACC_PRESENT)
    case cmuClock_CRYPTOACC:
#endif
#if defined(RADIOAES_PRESENT)
    case cmuClock_RADIOAES:
#endif
#if defined(CRYPTOACC_PRESENT)
    case cmuClock_CRYPTOAES:
    case cmuClock_CRYPTOPK:
#endif
      ret = SystemHCLKGet();
      break;

    case cmuClock_EXPCLK:
      ret = SystemSYSCLKGet() / CMU_ClockDivGet(cmuClock_EXPCLK);
      break;

    case cmuClock_PCLK:
    case cmuClock_USART0:
#if defined(USART_PRESENT) && USART_COUNT > 1
    case cmuClock_USART1:
#endif
    case cmuClock_I2C1:
    case cmuClock_PRS:
    case cmuClock_GPIO:
    case cmuClock_GPCRC:
    case cmuClock_LDMAXBAR:
    case cmuClock_SYSCFG:
    case cmuClock_DCDC:
    case cmuClock_BURAM:
    case cmuClock_DPLL0:
      ret = SystemHCLKGet() / CMU_ClockDivGet(cmuClock_PCLK);
      break;

