hanserf/efm32pg22_devkit/gecko_sdk_3.2.2/platform/emlib/src/em_cmu.c
    case cmuClock_LSPCLK:
    case cmuClock_I2C0:
    case cmuClock_AMUXCP0:
#if defined(ACMP_PRESENT)
    case cmuClock_ACMP0:
#if ACMP_COUNT > 1
    case cmuClock_ACMP1:
#endif
#endif
      ret = SystemHCLKGet() / CMU_ClockDivGet(cmuClock_PCLK) / 2U;
      break;

    case cmuClock_TRACECLK:
      traceClkGet(&freq, NULL);
      ret = freq / CMU_ClockDivGet(cmuClock_TRACECLK);
      break;

    case cmuClock_TIMER0:
    case cmuClock_TIMER1:
    case cmuClock_TIMER2:
    case cmuClock_TIMER3:
#if TIMER_COUNT > 4
    case cmuClock_TIMER4:
#endif
#if defined(KEYSCAN_PRESENT)
    case cmuClock_KEYSCAN:
#endif
    case cmuClock_EM01GRPACLK:
      em01GrpaClkGet(&ret, NULL);
      break;
#if defined(PDM_PRESENT)
    case cmuClock_PDM:
    case cmuClock_EM01GRPBCLK:
      em01GrpbClkGet(&ret, NULL);
      break;
#endif
#if defined(EUART_PRESENT)
    case cmuClock_EUART0:
    case cmuClock_EUART0CLK:
      euart0ClkGet(&ret, NULL);
      break;
#endif
#if defined(EUSART_PRESENT) && EUSART_COUNT > 0
    case cmuClock_EUSART0:
    case cmuClock_EUSART0CLK:
      eusart0ClkGet(&ret, NULL);
      break;
#if defined(EUSART_PRESENT) && EUSART_COUNT > 1
    case cmuClock_EUSART1:
#if defined(EUSART_PRESENT) && EUSART_COUNT > 2
    case cmuClock_EUSART2:
#endif
    case cmuClock_EM01GRPCCLK:
      em01GrpcClkGet(&ret, NULL);
      break;
#endif
#endif

    case cmuClock_IADC0:
    case cmuClock_IADCCLK:
      iadcClkGet(&ret, NULL);
      break;

    case cmuClock_SYSTICK:
      sysTickClkGet(&ret, NULL);
      break;

    case cmuClock_LETIMER0:
    case cmuClock_EM23GRPACLK:
#if defined(LESENSE_PRESENT)
    case cmuClock_LESENSE:
    case cmuClock_LESENSECLK:
#endif
      em23GrpaClkGet(&ret, NULL);
      break;

    case cmuClock_WDOG0:
    case cmuClock_WDOG0CLK:
      wdog0ClkGet(&ret, NULL);
      break;
#if WDOG_COUNT > 1
    case cmuClock_WDOG1:
    case cmuClock_WDOG1CLK:
      wdog1ClkGet(&ret, NULL);
      break;
#endif
#if defined(RTCC_PRESENT)
    case cmuClock_RTCC:
    case cmuClock_RTCCCLK:
      rtccClkGet(&ret, NULL);
      break;
#endif
#if defined(SYSRTC_PRESENT)
    case cmuClock_SYSRTC:
    case cmuClock_SYSRTCCLK:
      sysrtcClkGet(&ret, NULL);
      break;
#endif
#if defined(LCD_PRESENT)
    case cmuClock_LCD:
    case cmuClock_LCDCLK:
      lcdClkGet(&ret, NULL);
      break;
#endif
#if defined(VDAC_PRESENT)
    case cmuClock_VDAC0:
    case cmuClock_VDAC0CLK:
      vdac0ClkGet(&ret, NULL);
      break;
#if (VDAC_COUNT > 1)
    case cmuClock_VDAC1:
    case cmuClock_VDAC1CLK:
      vdac1ClkGet(&ret, NULL);
      break;
#endif
#endif /* VDAC_PRESENT */
#if defined(PCNT_PRESENT)
    case cmuClock_PCNT0:
    case cmuClock_PCNT0CLK:
      pcnt0ClkGet(&ret, NULL);
      break;
#endif
#if defined(LESENSE_PRESENT)
    case cmuClock_LESENSEHFCLK:
      lesenseHFClkGet(&ret, NULL);
      break;
#endif
    case cmuClock_BURTC:
    case cmuClock_EM4GRPACLK:
      em4GrpaClkGet(&ret, NULL);
      break;

    default:
      EFM_ASSERT(false);
      break;
  }

  return ret;
}

/*******************************************************************************
 **************************   LOCAL FUNCTIONS   ********************************
 ******************************************************************************/
#if defined(PDM_PRESENT)
/***************************************************************************//**
 * @brief
 *   Get selected oscillator and frequency for @ref cmuClock_EM01GRPBCLK
 *   clock tree.
 *
 * @param[out] freq
 *   The frequency.
 *
 * @param[out] sel
 *   The selected oscillator.
 ******************************************************************************/
static void em01GrpbClkGet(uint32_t *freq, CMU_Select_TypeDef *sel)
{
  uint32_t f = 0U;
  CMU_Select_TypeDef s;
  switch (CMU->EM01GRPBCLKCTRL & _CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) {
    case _CMU_EM01GRPBCLKCTRL_CLKSEL_HFRCODPLL:
      f = SystemHFRCODPLLClockGet();
      s = cmuSelect_HFRCODPLL;
      break;

    case _CMU_EM01GRPBCLKCTRL_CLKSEL_HFRCODPLLRT:
      f = SystemHFRCODPLLClockGet();
      s = cmuSelect_HFRCODPLLRT;
      break;

    case _CMU_EM01GRPBCLKCTRL_CLKSEL_HFXO:
      f = SystemHFXOClockGet();
      s = cmuSelect_HFXO;
      break;

    case _CMU_EM01GRPBCLKCTRL_CLKSEL_HFXORT:
      f = SystemHFXOClockGet();
      s = cmuSelect_HFXORT;
      break;

    case _CMU_EM01GRPBCLKCTRL_CLKSEL_FSRCO:
      f = SystemFSRCOClockGet();
      s = cmuSelect_FSRCO;
      break;

    case _CMU_EM01GRPBCLKCTRL_CLKSEL_CLKIN0:
      f = SystemCLKIN0Get();
      s = cmuSelect_CLKIN0;
      break;

    default:
      s = cmuSelect_Error;
      EFM_ASSERT(false);
      break;
  }
  if (freq != NULL) {
    *freq = f;
  }
  if (sel != NULL) {
    *sel = s;
  }
}
#endif

#if defined(EUART_PRESENT)
/***************************************************************************//**
 * @brief
 *   Get selected oscillator and frequency for @ref cmuClock_EUART0CLK
 *   clock tree.
 *
 * @param[out] freq
 *   The frequency.
 *
 * @param[out] sel
 *   The selected oscillator.
 ******************************************************************************/
static void euart0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel)
{
  switch (CMU->EUART0CLKCTRL & _CMU_EUART0CLKCTRL_CLKSEL_MASK) {
    case _CMU_EUART0CLKCTRL_CLKSEL_EM01GRPACLK:
      em01GrpaClkGet(freq, sel);
      break;

    case _CMU_EUART0CLKCTRL_CLKSEL_EM23GRPACLK:
      em23GrpaClkGet(freq, sel);
      break;

    default:
      if (freq != NULL) {
        *freq = 0U;
      }
      if (sel != NULL) {
        *sel = cmuSelect_Error;
      }
      EFM_ASSERT(false);
      break;
  }
}
#endif

#if defined(EUSART_PRESENT)
/***************************************************************************//**
 * @brief
 *   Get selected oscillator and frequency for @ref cmuClock_EUSART0CLK
 *   clock tree.
 *
 * @param[out] freq
 *   The frequency.
 *
 * @param[out] sel
 *   The selected oscillator.
 ******************************************************************************/
static void eusart0ClkGet(uint32_t *freq, CMU_Select_TypeDef *sel)
{
  uint32_t f = 0U;
  CMU_Select_TypeDef s;

  switch (CMU->EUSART0CLKCTRL & _CMU_EUSART0CLKCTRL_CLKSEL_MASK) {
    case CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK:
      em01GrpcClkGet(&f, NULL);
      s = cmuSelect_EM01GRPCCLK;
      break;

    case CMU_EUSART0CLKCTRL_CLKSEL_HFRCOEM23:
      f = SystemHFRCOEM23ClockGet();
      s = cmuSelect_HFRCOEM23;
      break;

