hanserf/efm32pg22_devkit/gecko_sdk_3.2.2/platform/emlib/src/em_cmu.c
// -----------------------------------------------------------------------------
#if defined (RTCC_PRESENT)
    case cmuClock_RTCC:
    case cmuClock_RTCCCLK:
      switch (ref) {
        case cmuSelect_LFRCO:
#if defined(PLFRCO_PRESENT)
        case cmuSelect_PLFRCO:
#endif
          tmp = CMU_RTCCCLKCTRL_CLKSEL_LFRCO;
          break;

        case cmuSelect_LFXO:
          tmp = CMU_RTCCCLKCTRL_CLKSEL_LFXO;
          break;

        case cmuSelect_ULFRCO:
          tmp = CMU_RTCCCLKCTRL_CLKSEL_ULFRCO;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->RTCCCLKCTRL = (CMU->RTCCCLKCTRL & ~_CMU_RTCCCLKCTRL_CLKSEL_MASK)
                         | tmp;
      break;
#endif
// -----------------------------------------------------------------------------
#if defined (SYSRTC_PRESENT)
    case cmuClock_SYSRTC:
    case cmuClock_SYSRTCCLK:
      switch (ref) {
        case cmuSelect_LFRCO:
#if defined(PLFRCO_PRESENT)
        case cmuSelect_PLFRCO:
#endif
          tmp = CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO;
          break;

        case cmuSelect_LFXO:
          tmp = CMU_SYSRTC0CLKCTRL_CLKSEL_LFXO;
          break;

        case cmuSelect_ULFRCO:
          tmp = CMU_SYSRTC0CLKCTRL_CLKSEL_ULFRCO;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK)
                            | tmp;
      break;
#endif
// -----------------------------------------------------------------------------
#if defined(LCD_PRESENT)
    case cmuClock_LCD:
    case cmuClock_LCDCLK:
      switch (ref) {
        case cmuSelect_LFRCO:
#if defined(PLFRCO_PRESENT)
        case cmuSelect_PLFRCO:
#endif
          tmp = CMU_LCDCLKCTRL_CLKSEL_LFRCO;
          break;

        case cmuSelect_LFXO:
          tmp = CMU_LCDCLKCTRL_CLKSEL_LFXO;
          break;

        case cmuSelect_ULFRCO:
          tmp = CMU_LCDCLKCTRL_CLKSEL_ULFRCO;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->LCDCLKCTRL =  (CMU->LCDCLKCTRL  & ~_CMU_LCDCLKCTRL_CLKSEL_MASK)
                        | tmp;
      break;
#endif
// -----------------------------------------------------------------------------
#if defined(VDAC_PRESENT)
    case cmuClock_VDAC0:
    case cmuClock_VDAC0CLK:
      switch (ref) {
        case cmuSelect_FSRCO:
          tmp = CMU_VDAC0CLKCTRL_CLKSEL_FSRCO;
          break;
        case cmuSelect_HFRCOEM23:
          tmp = CMU_VDAC0CLKCTRL_CLKSEL_HFRCOEM23;
          break;
        case cmuSelect_EM01GRPACLK:
          tmp = CMU_VDAC0CLKCTRL_CLKSEL_EM01GRPACLK;
          break;
        case cmuSelect_EM23GRPACLK:
          tmp = CMU_VDAC0CLKCTRL_CLKSEL_EM23GRPACLK;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->VDAC0CLKCTRL = (CMU->VDAC0CLKCTRL & ~_CMU_VDAC0CLKCTRL_CLKSEL_MASK)
                          | tmp;
      break;
#if (VDAC_COUNT > 1)
    case cmuClock_VDAC1:
    case cmuClock_VDAC1CLK:
      switch (ref) {
        case cmuSelect_FSRCO:
          tmp = CMU_VDAC1CLKCTRL_CLKSEL_FSRCO;
          break;
        case cmuSelect_HFRCOEM23:
          tmp = CMU_VDAC1CLKCTRL_CLKSEL_HFRCOEM23;
          break;
        case cmuSelect_EM01GRPACLK:
          tmp = CMU_VDAC1CLKCTRL_CLKSEL_EM01GRPACLK;
          break;
        case cmuSelect_EM23GRPACLK:
          tmp = CMU_VDAC1CLKCTRL_CLKSEL_EM23GRPACLK;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->VDAC1CLKCTRL = (CMU->VDAC1CLKCTRL & ~_CMU_VDAC1CLKCTRL_CLKSEL_MASK)
                          | tmp;
      break;
#endif
#endif /* VDAC_PRESENT */
// -----------------------------------------------------------------------------
#if defined(PCNT_PRESENT)
    case cmuClock_PCNT0:
    case cmuClock_PCNT0CLK:
      switch (ref) {
        case cmuSelect_EM23GRPACLK:
          tmp = CMU_PCNT0CLKCTRL_CLKSEL_EM23GRPACLK;
          break;

        case cmuSelect_PCNTEXTCLK:
          tmp = CMU_PCNT0CLKCTRL_CLKSEL_PCNTS0;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->PCNT0CLKCTRL = (CMU->PCNT0CLKCTRL & ~_CMU_PCNT0CLKCTRL_CLKSEL_MASK)
                          | tmp;
      break;
#endif
// -----------------------------------------------------------------------------
#if defined(LESENSE_PRESENT)
    case cmuClock_LESENSEHFCLK:
      switch (ref) {
        case cmuSelect_FSRCO:
          tmp = CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO;
          break;
        case cmuSelect_HFRCOEM23:
          tmp = CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23;
          break;

        default:
          EFM_ASSERT(false);
          break;
      }
      CMU->LESENSEHFCLKCTRL = (CMU->LESENSEHFCLKCTRL & ~_CMU_LESENSEHFCLKCTRL_CLKSEL_MASK)
                              | tmp;
      break;
#endif
    default:
      EFM_ASSERT(false);
      break;
  }
}

/***************************************************************************//**
 * @brief
 *   Gets the precision (in PPM) of the specified low frequency clock branch.
 *
 * @param[in] clock
 *   Clock branch.
 *
 * @return
 *   Precision, in PPM, of the specified clock branch.
 *
 * @note
 *   This function is only for internal usage.
 *
 * @note
 *   The current implementation of this function is used to determine if the
 *   clock has a precision <= 500 ppm or not (which is the minimum required
 *   for BLE). Future version of this function should provide more accurate
 *   precision numbers to allow for further optimizations from the stacks.
 ******************************************************************************/
uint16_t CMU_LF_ClockPrecisionGet(CMU_Clock_TypeDef clock)
{
  CMU_Select_TypeDef src = CMU_ClockSelectGet(clock);
  uint16_t precision;

  switch (src) {
    case cmuSelect_LFXO:
      precision = lfxo_precision;
      break;

#if defined(PLFRCO_PRESENT)
#if defined(_SILICON_LABS_32B_SERIES_1)
    case cmuSelect_PLFRCO:
      precision = 500;
      break;
#endif

#if defined(LFRCO_CFG_HIGHPRECEN)
    case cmuSelect_LFRCO:
    case cmuSelect_PLFRCO:

      CMU->CLKEN0_SET = CMU_CLKEN0_LFRCO;

      if (LFRCO->CFG & _LFRCO_CFG_HIGHPRECEN_MASK) {
        precision = 500;
      } else {
        precision = 0xFFFF;
      }
      break;
#endif
#endif

    default:
      precision = 0xFFFF;
      break;
  }

  return precision;
}

/**************************************************************************//**
 * @brief
 *   Lock the DPLL to a given frequency.
 *   The frequency is given by: Fout = Fref * (N+1) / (M+1).
 *
 * @note
 *   This function does not check if the given N & M values will actually
 *   produce the desired target frequency. @n
 *   N & M limitations: @n
 *     300 < N <= 4095 @n
 *     0 <= M <= 4095 @n
 *   Any peripheral running off HFRCODPLL should be switched to a lower
 *   frequency clock (if possible) prior to calling this function to avoid
 *   over-clocking.
 *
 * @param[in] init
 *    DPLL setup parameter struct.
 *
 * @return
 *   Returns false on invalid target frequency or DPLL locking error.
 *****************************************************************************/
bool CMU_DPLLLock(const CMU_DPLLInit_TypeDef *init)
{
  int index = 0;
  unsigned int i;
  bool hclkDivIncreased = false;
  uint32_t hfrcoCalVal, lockStatus = 0, hclkDiv = 0, sysFreq;
  uint32_t hfrcoFreqRangeExpected;
  uint32_t hfrcoFreqRangeActual;
  uint32_t hfrcoCalCurrent;
  bool hfrcoClamped = false;
  bool restoreDpll;

