hanserf/efm32pg22_devkit/gecko_sdk_3.2.2/platform/emlib/src/em_cmu.c
#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_3) || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_4)
    //See [PM-3665] for details.
    if (hfxoInit->mode == cmuHfxoOscMode_ExternalSinePkDet) {
      HFXO0->XTALCFG = 0;
      HFXO0->XTALCTRL = 0;

      const uint32_t PKDETTHSTARTUP_PARAMETER_1 = 2UL;
      BUS_RegMaskedWrite((volatile uint32_t *)(HFXO0_BASE + 0x34UL),
                         0x0000F000UL | 0x00000F00UL,
                         (PKDETTHSTARTUP_PARAMETER_1 << 12) | (PKDETTHSTARTUP_PARAMETER_1 << 8));
    }
#endif

    HFXO0->CTRL = (HFXO0->CTRL & ~(_HFXO_CTRL_FORCEXO2GNDANA_MASK
                                   | _HFXO_CTRL_FORCEXI2GNDANA_MASK
                                   | _HFXO_CTRL_DISONDEMAND_MASK
#if defined(HFXO_CTRL_EM23ONDEMAND)
                                   | _HFXO_CTRL_EM23ONDEMAND_MASK
#endif
                                   | _HFXO_CTRL_FORCEEN_MASK))
                  | (hfxoInit->forceXo2GndAna << _HFXO_CTRL_FORCEXO2GNDANA_SHIFT)
                  | (hfxoInit->disOnDemand    << _HFXO_CTRL_DISONDEMAND_SHIFT)
#if defined(HFXO_CTRL_EM23ONDEMAND)
                  | (hfxoInit->em23OnDemand   << _HFXO_CTRL_EM23ONDEMAND_SHIFT)
#endif
                  | (hfxoInit->forceEn        << _HFXO_CTRL_FORCEEN_SHIFT);
  }

  if (hfxoInit->regLock) {
    HFXO0->LOCK = ~HFXO_LOCK_LOCKKEY_UNLOCK;
  }
}

#if defined(HFXO0_BUFOUT)
/**************************************************************************//**
 * @brief
 *   Initialize HFXO Bufout (Crystal sharing) leader control registers.
 *   Configure's the bufout request input GPIO as a clock request signal
 *   to add the crystal sharing follower chip as a source of clock request.
 *
 * @warning
 *   If EM2 capabilities are needed, a gpio that fully retains it's
 *   capabilities while in EM2 must be selected.
 *
 * @param[in] bufoutInit
 *   Bufout setup parameters
 *
 * @param[in] port
 *   Bufout request gpio port
 *
 * @param[in] pin
 *   Bufout request gpio pin
 *****************************************************************************/
void CMU_HFXOStartCrystalSharingLeader(const CMU_BUFOUTLeaderInit_TypeDef *bufoutInit,
                                       GPIO_Port_TypeDef                   port,
                                       unsigned int                        pin)
{
  EFM_ASSERT(GPIO_PORT_PIN_VALID(port, pin));

  // Configure Bufout request GPIO.
  GPIO_PinModeSet(port, pin, gpioModeInput, 0U);
  GPIO->SYXOROUTE[0].BUFOUTREQINASYNCROUTE = pin    << _GPIO_SYXO_BUFOUTREQINASYNCROUTE_PIN_SHIFT
                                             | port << _GPIO_SYXO_BUFOUTREQINASYNCROUTE_PORT_SHIFT;

  bool wasLocked = HFXO0->STATUS & HFXO_STATUS_LOCK_LOCKED ? true : false;

  // Unlock register interface.
  HFXO0->LOCK = HFXO_LOCK_LOCKKEY_UNLOCK;

  HFXO0->CTRL_CLR = _HFXO_CTRL_BUFOUTFREEZE_MASK | _HFXO_CTRL_DISONDEMANDBUFOUT_MASK;

  BUS_RegMaskedWrite(&HFXO0->BUFOUTCTRL,
                     _HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_MASK
                     | _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_MASK,
                     bufoutInit->minimalStartupDelay  << _HFXO_BUFOUTCTRL_MINIMUMSTARTUPDELAY_SHIFT
                     | bufoutInit->timeoutStartup       << _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_SHIFT);

  if (wasLocked) {
    HFXO0->LOCK = ~HFXO_LOCK_LOCKKEY_UNLOCK;
  }
}
#endif

#if defined(_HFXO_CTRL_PRSSTATUSSEL0_MASK)
/**************************************************************************//**
 * @brief
 *   Initialize HFXO Bufout (Crystal sharing) follower control registers.
 *   Configure  the clock request signal to a specified gpio to automatically
 *   request the high frequency crystal oscillator sine wave clock.
 *   This function must be used in conjunction with CMU_HFXOInit configured
 *   with EXTERNAL_SINE or EXTERNAL_SINEPKDET mode.
 *
 * @warning
 *   If EM2 capabilities are needed, a gpio that fully retains it's
 *   capabilities while in EM2 must be selected.
 *
 * @note
 *   This function can be emulated on XG21/XG22 chips by controlling the clock
 *   request gpio to ask the crystal sharing leader clock when needed.
 *
 * @param[in] prsStatusSelectOutput
 *    Selected HFXO prs signal output
 *
 * @param[in] prsAsyncCh
 *    PRS producer asynchronous signal channel
 *
 * @param[in] port
 *    Bufout request gpio port
 *
 * @param[in] pin
 *    Bufout request gpio pin
 *****************************************************************************/
void CMU_HFXOCrystalSharingFollowerInit(CMU_PRS_Status_Output_Select_TypeDef prsStatusSelectOutput,
                                        unsigned int                         prsAsyncCh,
                                        GPIO_Port_TypeDef                    port,
                                        unsigned int                         pin)
{
  EFM_ASSERT(prsAsyncCh < PRS_ASYNC_CH_NUM);
  EFM_ASSERT(GPIO_PORT_PIN_VALID(port, pin));

  uint32_t mask = 0U, prsSignal = 0U, value = 0U;

  switch (prsStatusSelectOutput) {
    case PRS_Status_select_0:
      mask      = _HFXO_CTRL_PRSSTATUSSEL0_MASK;
      value     = _HFXO_CTRL_PRSSTATUSSEL0_ENS << _HFXO_CTRL_PRSSTATUSSEL0_SHIFT;
      prsSignal = _PRS_ASYNC_CH_CTRL_SIGSEL_HFXO0LSTATUS;
      break;

    case PRS_Status_select_1:
      mask      = _HFXO_CTRL_PRSSTATUSSEL1_MASK;
      value     = _HFXO_CTRL_PRSSTATUSSEL1_ENS << _HFXO_CTRL_PRSSTATUSSEL1_SHIFT;
      prsSignal = _PRS_ASYNC_CH_CTRL_SIGSEL_HFXO0LSTATUS1;
      break;

    default:
      EFM_ASSERT(false);
      break;
  }

  bool wasLocked = HFXO0->STATUS & HFXO_STATUS_LOCK_LOCKED ? true : false;

  // Unlock register interface.
  HFXO0->LOCK = HFXO_LOCK_LOCKKEY_UNLOCK;

  BUS_RegMaskedWrite(&HFXO0->CTRL, mask, value);

  if (wasLocked) {
    HFXO0->LOCK = ~HFXO_LOCK_LOCKKEY_UNLOCK;
  }

  value = _PRS_ASYNC_CH_CTRL_AUXSEL_DEFAULT     << _PRS_ASYNC_CH_CTRL_AUXSEL_SHIFT
          | _PRS_ASYNC_CH_CTRL_FNSEL_A          << _PRS_ASYNC_CH_CTRL_FNSEL_SHIFT
          | _PRS_ASYNC_CH_CTRL_SOURCESEL_HFXO0L << _PRS_ASYNC_CH_CTRL_SOURCESEL_SHIFT
          | prsSignal                           << _PRS_ASYNC_CH_CTRL_SIGSEL_SHIFT;

