hanserf/efm32pg22_devkit/gecko_sdk_3.2.2/platform/emlib/src/em_cmu.c
  mask = _PRS_ASYNC_CH_CTRL_AUXSEL_MASK
         | _PRS_ASYNC_CH_CTRL_FNSEL_MASK
         | _PRS_ASYNC_CH_CTRL_SOURCESEL_MASK
         | _PRS_ASYNC_CH_CTRL_SIGSEL_MASK;

  BUS_RegMaskedWrite(&(PRS->ASYNC_CH[prsAsyncCh].CTRL), mask, value);

  GPIO_PinModeSet(port, pin, gpioModeWiredOrPullDown, 0U);

  (&(GPIO->PRSROUTE[0].ASYNCH0ROUTE))[prsAsyncCh] = pin    << _GPIO_PRS_ASYNCH0ROUTE_PIN_SHIFT
                                                    | port << _GPIO_PRS_ASYNCH0ROUTE_PORT_SHIFT;
  GPIO->PRSROUTE[0].ROUTEEN = 1U << (_GPIO_PRS_ROUTEEN_ASYNCH0PEN_SHIFT + prsAsyncCh);
}
#endif

#if defined(_SILICON_LABS_32B_SERIES_2)
/**************************************************************************//**
 * @brief
 *   Set the HFXO crystal tuning delta.
 *
 * @param[in] delta
 *    Chip dependent crystal capacitor bank delta between HFXO XI and XO.
 *
 * @note
 *   The delta between XI and XO is applicable for the series 2 EFR32xG2
 *   devices only.
 *****************************************************************************/
void CMU_HFXOCTuneDeltaSet(int32_t delta)
{
  ctuneDelta = (int8_t)delta;
}

/**************************************************************************//**
 * @brief
 *   Get the HFXO crystal tuning delta.
 *
 * @return
 *   Chip dependent crystal capacitor bank tuning delta.
 *****************************************************************************/
int32_t CMU_HFXOCTuneDeltaGet(void)
{
  return (int32_t)ctuneDelta;
}
#endif /* defined(_SILICON_LABS_32B_SERIES_2) */

/**************************************************************************//**
 * @brief
 *   Initialize LFXO control registers.
 *
 * @note
 *   LFXO configuration should be obtained from a configuration tool,
 *   app note or crystal datasheet. This function disables the LFXO to ensure
 *   a valid state before update.
 *
 * @param[in] lfxoInit
 *    LFXO setup parameters
 *****************************************************************************/
void CMU_LFXOInit(const CMU_LFXOInit_TypeDef *lfxoInit)
{
  EFM_ASSERT(lfxoInit->timeout
             <= (_LFXO_CFG_TIMEOUT_MASK  >> _LFXO_CFG_TIMEOUT_SHIFT));
  EFM_ASSERT(lfxoInit->mode
             <= (_LFXO_CFG_MODE_MASK >> _LFXO_CFG_MODE_SHIFT));
  EFM_ASSERT(lfxoInit->gain
             <= (_LFXO_CAL_GAIN_MASK >> _LFXO_CAL_GAIN_SHIFT));
  EFM_ASSERT(lfxoInit->capTune
             <= (_LFXO_CAL_CAPTUNE_MASK >> _LFXO_CAL_CAPTUNE_SHIFT));

  // Max internal capacitance tuning value is 0x4F (20 pF)
  uint8_t ctune = SL_MIN(0x4FU, lfxoInit->capTune);

#if defined(CMU_CLKEN0_LFXO)
  // Enable LFXO module clock.
  CMU->CLKEN0_SET = CMU_CLKEN0_LFXO;
#endif

  // Unlock register interface
  LFXO->LOCK = LFXO_LOCK_LOCKKEY_UNLOCK;

  // Disable LFXO
  LFXO->CTRL_SET = LFXO_CTRL_DISONDEMAND;
  LFXO->CTRL_CLR = LFXO_CTRL_FORCEEN;
  while ((LFXO->STATUS & _LFXO_STATUS_ENS_MASK) != 0U) {
  }

  // Configure LFXO as specified
  LFXO->CAL = ((uint32_t)lfxoInit->gain  << _LFXO_CAL_GAIN_SHIFT)
              | ((uint32_t)ctune         << _LFXO_CAL_CAPTUNE_SHIFT);

  LFXO->CFG = (lfxoInit->timeout           << _LFXO_CFG_TIMEOUT_SHIFT)
              | (lfxoInit->mode            << _LFXO_CFG_MODE_SHIFT)
              | (lfxoInit->highAmplitudeEn << _LFXO_CFG_HIGHAMPL_SHIFT)
              | (lfxoInit->agcEn           << _LFXO_CFG_AGC_SHIFT);

  LFXO->CTRL = (lfxoInit->failDetEM4WUEn   << _LFXO_CTRL_FAILDETEM4WUEN_SHIFT)
               | (lfxoInit->failDetEn      << _LFXO_CTRL_FAILDETEN_SHIFT)
               | (lfxoInit->disOnDemand    << _LFXO_CTRL_DISONDEMAND_SHIFT)
               | (lfxoInit->forceEn        << _LFXO_CTRL_FORCEEN_SHIFT);

  if (lfxoInit->regLock) {
    LFXO->LOCK = ~LFXO_LOCK_LOCKKEY_UNLOCK;
  }
}

/**************************************************************************//**
 * @brief
 *   Sets LFXO's crystal precision, in PPM.
 *
 * @note
 *   LFXO precision should be obtained from a crystal datasheet.
 *
 * @param[in] precision
 *    LFXO's crystal precision, in PPM.
 *****************************************************************************/
void CMU_LFXOPrecisionSet(uint16_t precision)
{
  lfxo_precision = precision;
}

#if defined(PLFRCO_PRESENT)
/**************************************************************************//**
 * @brief
 *   Configure the LFRCO precision.
 *
 * @details
 *   When enabling high precision mode on the LFRCO the hardware will tune
 *   the oscillator automatically using the HFXO as a reference.
 *
 * @note
 *   Refer to the reference manual and the datasheet for details about
 *   NOMCAL and NOMCALINV calibration count values.
 *
 * @param[in] precision
 *    LFRCO precision, this can be either high or default.
 *****************************************************************************/
void CMU_LFRCOSetPrecision(CMU_Precision_TypeDef precision)
{
  uint32_t ref = 0;
  uint32_t nomcal = 0;
  uint32_t nomcalinv = 0;

  CMU->CLKEN0_SET = CMU_CLKEN0_LFRCO;

  LFRCO->CTRL = LFRCO_CTRL_DISONDEMAND; // Force disable
  while ((LFRCO->STATUS & LFRCO_STATUS_ENS) != 0U) {
    // Wait for LFRCO to stop
  }

  if (precision == cmuPrecisionHigh) {
    ref = SystemHFXOClockGet();
    // Use precomputed value for HFXO typical frequencies
    if (ref == XTAL_38M4) {
      nomcal = LFRCO_NOMCAL_XTAL_38M4;
      nomcalinv = LFRCO_NOMCALINV_XTAL_38M4;
    } else if (ref == XTAL_39M0) {
      nomcal = LFRCO_NOMCAL_XTAL_39M0;
      nomcalinv = LFRCO_NOMCALINV_XTAL_39M0;
    } else {
      // Compute calibration count, based on HFXO frequency
      nomcal = (5 * ref) >> 9;
      nomcalinv = ((1UL << 31) / 5) << 2;
      nomcalinv /= (ref >> 9);
    }

    LFRCO->NOMCAL = nomcal;
    LFRCO->NOMCALINV = nomcalinv;

    LFRCO->CFG = LFRCO_CFG_HIGHPRECEN;
  } else {
    LFRCO->CFG = 0;
  }
  LFRCO->CTRL = _LFRCO_CTRL_RESETVALUE;
}
#endif

/***************************************************************************//**
 * @brief
 *   Get oscillator frequency tuning setting.
 *
 * @param[in] osc
 *   Oscillator to get tuning value for.
 *
 * @return
 *   The oscillator frequency tuning setting in use.
 ******************************************************************************/
uint32_t CMU_OscillatorTuningGet(CMU_Osc_TypeDef osc)
{
  uint32_t ret = 0U;

  switch (osc) {
#if defined(_LFRCO_CAL_FREQTRIM_MASK)
    case cmuOsc_LFRCO:
#if defined(CMU_CLKEN0_LFRCO)
      CMU->CLKEN0_SET = CMU_CLKEN0_LFRCO;
#endif
      ret = (LFRCO->CAL & _LFRCO_CAL_FREQTRIM_MASK)
            >> _LFRCO_CAL_FREQTRIM_SHIFT;
      break;
#endif

